/*
 *  << , >>
 *  쉬프트연산자 => 비트이동 연산자
 *  << : 왼쪽으로 이동 (숫자가 커짐) ==> 공백에 0을 채운다 ==> 산술
 *     =========> X << Y ==> X * 2 ^ Y 
 *     =========> 10 << 2 ==> 10 % 2 ^ 2 ==> 40
 *     1010 => 10
 *   101000 => 40
 *   
 *  >> : 오른쪽으로 이동 (숫자가 작아짐) ==> 비트를 제거 ==> 산술
 *     =========> X >> Y ==> X / 2 ^ Y
 *     =========> 10 >> 2 ==> 10 / 2 ^ 2 ==> 10 / 4 ==> 2 (정수/정수 = 정수)
 *     1010 => 10
 *       10 => 2
 *       
 *     8 << 3 
 *     1000
 *   100000 ==> 64
 *        
 *     8 >> 3
 *     1000
 *        1 ==> 1
 *     20 << 3 ==> 20*2^3 => 20*8 => 160
 *     20 >> 3 ==> 20/2*3 => 20/8 => 2
 *     
 *     20 => 10100
 *     
 *     10100 << 3
 *     10100000 => 160
 *       
 */ 
public class 이항연산자_쉬프트연산자 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
